## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                    NAME                                    |
|----------|----------------------------------------------------------------------------|
| update   | `aws_cloudwatch_log_metric_filter.coredns-nxdomain-notification-filter[0]` |
|          | `aws_cloudwatch_metric_alarm.coredns-nxdomain-notification-warning[0]`     |
|          | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`             |
| recreate | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
15:22:54.547 STDOUT terraform:   ~ update in-place
15:22:54.547 STDOUT terraform: -/+ destroy and then create replacement
15:22:54.547 STDOUT terraform: Terraform will perform the following actions:
15:22:54.547 STDOUT terraform:   # aws_cloudwatch_log_metric_filter.coredns-nxdomain-notification-filter[0] will be updated in-place
15:22:54.547 STDOUT terraform:   ~ resource "aws_cloudwatch_log_metric_filter" "coredns-nxdomain-notification-filter" {
15:22:54.547 STDOUT terraform:         id             = "CoreDNSNXDOMAINNotificationFilter"
15:22:54.547 STDOUT terraform:         name           = "CoreDNSNXDOMAINNotificationFilter"
15:22:54.547 STDOUT terraform:       ~ pattern        = "{ $.log = \"*notification*\" && $.log = \"*NXDOMAIN*\" }" -> "{ $.log = \"*notification.canada.ca. *\" && $.log = \"*NXDOMAIN*\" }"
15:22:54.548 STDOUT terraform:         # (1 unchanged attribute hidden)
15:22:54.548 STDOUT terraform:         # (1 unchanged block hidden)
15:22:54.548 STDOUT terraform:     }
15:22:54.548 STDOUT terraform:   # aws_cloudwatch_metric_alarm.coredns-nxdomain-notification-warning[0] will be updated in-place
15:22:54.548 STDOUT terraform:   ~ resource "aws_cloudwatch_metric_alarm" "coredns-nxdomain-notification-warning" {
15:22:54.548 STDOUT terraform:       ~ alarm_actions                         = [
15:22:54.548 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
15:22:54.548 STDOUT terraform:         ]
15:22:54.548 STDOUT terraform:       ~ alarm_description                     = "More than 30 NXDOMAIN responses containing 'notification' in CoreDNS logs in 5 minutes" -> "More than 30 NXDOMAIN responses containing the basedomain in CoreDNS logs in 5 minutes"
15:22:54.548 STDOUT terraform:         id                                    = "coredns-nxdomain-notification-warning"
15:22:54.548 STDOUT terraform:       ~ ok_actions                            = [
15:22:54.548 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
15:22:54.548 STDOUT terraform:         ]
15:22:54.548 STDOUT terraform:         tags                                  = {}
15:22:54.548 STDOUT terraform:         # (19 unchanged attributes hidden)
15:22:54.548 STDOUT terraform:     }
15:22:54.548 STDOUT terraform:   # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
15:22:54.548 STDOUT terraform:   ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
15:22:54.548 STDOUT terraform:         id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
15:22:54.549 STDOUT terraform:       ~ release_version        = "1.33.0-20250519" -> "1.33.0-20250627"
15:22:54.549 STDOUT terraform:         tags                   = {
15:22:54.549 STDOUT terraform:             "CostCenter"             = "notification-canada-ca-production"
15:22:54.549 STDOUT terraform:             "Name"                   = "notification-canada-ca"
15:22:54.549 STDOUT terraform:             "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
15:22:54.549 STDOUT terraform:         }
15:22:54.549 STDOUT terraform:         # (16 unchanged attributes hidden)
15:22:54.549 STDOUT terraform:         # (3 unchanged blocks hidden)
15:22:54.549 STDOUT terraform:     }
15:22:54.549 STDOUT terraform:   # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
15:22:54.549 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
15:22:54.549 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
15:22:54.549 STDOUT terraform:       + has_secret_string_wo = (known after apply)
15:22:54.549 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20250610153711956300000001" -> (known after apply)
15:22:54.549 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
15:22:54.549 STDOUT terraform:       ~ version_id           = "terraform-20250610153711956300000001" -> (known after apply)
15:22:54.549 STDOUT terraform:       ~ version_stages       = [
15:22:54.549 STDOUT terraform:           - "AWSCURRENT",
15:22:54.549 STDOUT terraform:         ] -> (known after apply)
15:22:54.550 STDOUT terraform:         # (3 unchanged attributes hidden)
15:22:54.550 STDOUT terraform:     }
15:22:54.550 STDOUT terraform: Plan: 1 to add, 3 to change, 1 to destroy.
15:22:54.550 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
15:22:54.550 STDOUT terraform: Saved the plan to: plan.tfplan
15:22:54.550 STDOUT terraform: To perform exactly these actions, run the following command to apply:
15:22:54.550 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.oom-errors[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
